<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest version of Arduino.

Set the ARCHITECTURE variable to "macOS_64bit" for Intel
Set the ARCHITECTURE variable to "macOS_ARM64" for Apple Silicon
</string>
    <key>Identifier</key>
    <string>com.github.putnajoe.munki.</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>ArduinoIDE</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Arduino</string>
         <key>ARCHITECTURE</key>
        <string>macOS_ARM64</string>
       <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string></string>
            <key>display_name</key>
            <string>Arduino IDE</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.putnajoe.download.Arduino</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>